W4D5/Capybara/app/controllers/users_controller.rb

    def index
        @user = User.all
---
SELECT "users".* FROM "users"

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "ari"], ["password_digest", "$2a$10$C7ihJe/QSyGpNUpl6s2fyu2XxnNxXALeNDr60xubo5nWcu5zKucxa"], ["session_token", "icVPGXLQTfVrp-TtOpYnUg"]]