W4D5/Capybara/app/models/user.rb

    def self.find_by_credentials(email, password)
        user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "q9PRF9-6OlBEQgke6d3QlA"], ["id", 3]]